Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Analysis.gbXMLBuildingType,Autodesk.Revit.DB.Document)
Gets the user-visible name for a gbXMLBuildingType.
Remarks:
The name is obtained in the current Revit language.
buildingType:
The gbXMLBuildingType to get the user-visible name.
document:
The document from which to get the gbXMLBuildingType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gXMLBuildingType is not available in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelForDiscipline(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a discipline.
Remarks:
The name is obtained in the current Revit language.
disciplineTypeId:
Identifier of the discipline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Discipline must have a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.LabelUtils.GetLabelForSymbol(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a symbol.
Remarks:
The name is obtained in the current Revit language.
symbolTypeId:
Identifier of the symbol to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Symbol must have a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelForSpec(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a spec.
Remarks:
The name is obtained in the current Revit language.
If the given identifier is a category, this method returns the name
of the Family Type spec with that category, e.g. "Family Type: Walls".
specTypeId:
Identifier of the spec to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given identifier is neither a spec nor a category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelForUnit(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a unit.
Remarks:
The name is obtained in the current Revit language.
unitTypeId:
Identifier of the unit to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find DisplayUnitTypeInfo for the given unit identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.BuiltInCategory)
Gets the user-visible name for a BuiltInCategory.
builtInCategory:  The BuiltInCategory to get the user-visible name.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the builtin category is not valid.
Since:  2020

Autodesk.Revit.DB.LabelUtils.GetLabelForGroup(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a built-in parameter group. To get the name of parameter group "Other", pass an empty, default-constructed ForgeTypeId.
groupTypeId:  The identifier of the parameter group to get the user-visible name, or an empty ForgeTypeId for group "Other".
Remarks:  The name is obtained in the current Revit language.

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.BuiltInParameter,Autodesk.Revit.ApplicationServices.LanguageType)
Gets the user-visible name for a BuiltInParameter in a specific LanguageType.
builtInParam:  The BuiltInParameter to get the user-visible name.
language:  The desired LanguageType to get the user-visible name in.
Returns:  The BuiltInParameter name in the desired LanguageType.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the BuiltInParameter cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the desired LanguageType cannot be found for the BuiltInParameter name.
Since:  2020

Autodesk.Revit.DB.LabelUtils.GetLabelForBuiltInParameter(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.ApplicationServices.LanguageType)
Gets the user-visible name for a built-in parameter in a specific LanguageType.
parameterTypeId:  Identifier of the built-in parameter to get the user-visible name.
language:  The desired LanguageType to get the user-visible name in.
Returns:  The built-in parameter name in the desired LanguageType.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the built-in parameter cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the desired LanguageType cannot be found for the built-in parameter name.
Since:  2020

Autodesk.Revit.DB.LabelUtils.GetLabelForBuiltInParameter(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a built-in parameter.
parameterTypeId:  Identifier of the built-in parameter to get the user-visible name.
Remarks:  The name is obtained in the current Revit language.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:  Thrown when the built-in parameter cannot be found.